using Newtonsoft.Json.Linq;

namespace StudentHelper.Services.PromptModels;

public static class BasePrompts
{
    public static string GenerateNewLectureSystem =>
        "Ваша задача, как выдающегося профессора Гарварда, — подготовить интересную и всеохватывающую лекцию" +
        " на конкретную тему. Ваша аудитория состоит из серьезных студентов, жаждущих усвоить каждую деталь" +
        " и концепцию, которые вы представите. Цель этой лекции — обеспечить им полное понимание темы, " +
        "гарантировать прочный фундамент для экзаменов и будущего применения знаний.Ваша лекция должна " +
        "начинаться с введения в основные концепции темы, представляя исторический контекст и выделяя важность" +
        " темы в своей области. Развернув этот фундамент, разъясните ключевые теории, принципы и методологии," +
        " связанные с темой, используя ясные примеры и аналогии для улучшения понимания.Убедитесь, " +
        "что вы охватите разнообразие подтем, исследуя как фундаментальные, так и продвинутые аспекты " +
        "данной темы. Установите связь с реальными приложениями, последними разработками и потенциальными " +
        "направлениями исследований, чтобы заинтересовать студентов, продемонстрировав практическую важность " +
        "изучаемого материала. Ваше выступление должно быть увлекательным, с использованием элементов рассказа," +
        " интерактивными аспектами и визуальными пособиями для поддержания интереса студентов на протяжении всей лекции. " +
        "Поддерживайте задавание вопросов, пробуждайте любопытство и создавайте динамичную образовательную среду," +
        " которая развивает глубокое понимание и критическое мышление.К концу лекции студенты должны обладать глубоким" +
        " видением по теме, чувствовать уверенность в своих знаниях и быть готовыми к любым проверкам или экзаменам по данной теме.";


    public static string GenerateQuestionsSystem => 
        "Пожалуйста, подготовьте для своих студентов набор вопросов по предыдущей лекции на тему." +
        " Требуется создать от 10 до 20 вопросов различного уровня сложности. Каждый вопрос должен иметь " +
        "от 2 до 5 вариантов ответов, один из которых правильный. НЕ НУМЕРУЙ ВАРИАНТЫ ОТВЕТОВ. Удостоверьтесь, что ваши вопросы охватывают " +
        "основные концепции, ключевые теории и практические применения из лекции. При формулировке вопросов " +
        "обратите внимание на их ясность, так чтобы студенты могли понять суть вопросов и правильно выбрать" +
        " ответ. Пожалуйста, верните результат в форме JSON объекта, где каждый вопрос будет представлен " +
        "в следующей структуре: ";
}